tap "anomalyco/tap"
tap "chipsalliance/verible"
tap "cirruslabs/cli"
tap "domt4/autoupdate"
tap "hashicorp/tap"
tap "homeport/tap"
tap "riscv-software-src/riscv"
brew "asciidoctor"
brew "autoconf"
brew "bat"
brew "binutils"
brew "bison"
brew "boost"
brew "buildifier"
brew "cargo-binstall"
brew "cargo-nextest"
brew "ccusage"
brew "cmake"
brew "codesnap"
brew "coreutils"
brew "cpanminus"
brew "csvlens"
brew "difftastic"
brew "direnv"
brew "dotter"
brew "duti"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "flex"
brew "fzf"
brew "g-ls"
brew "gcc"
brew "git-delta"
brew "glab"
brew "go"
brew "graphviz"
brew "gtop"
brew "helix"
brew "help2man"
brew "htop"
brew "jq"
brew "llm"
brew "llvm@19", link: true
brew "lsd"
brew "mdformat"
brew "neovim"
brew "ninja"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "poppler"
brew "prettier"
brew "pv"
brew "python@3.13"
brew "qemu"
brew "ripgrep"
brew "ruff"
brew "specify"
brew "sshpass"
brew "terminal-notifier"
brew "tmux"
brew "tokei"
brew "tree"
brew "ty"
brew "uv"
brew "verilator"
brew "wget"
brew "worktrunk"
brew "xorriso"
brew "yq"
brew "yt-dlp"
brew "zellij"
brew "chipsalliance/verible/verible"
brew "cirruslabs/cli/tart"
brew "hashicorp/tap/packer"
brew "homeport/tap/termshot"
brew "riscv-software-src/riscv/riscv-tools"
cask "anki"
cask "claude-code"
cask "espanso"
cask "font-maple-mono"
cask "ghostty"
cask "jordanbaird-ice"
cask "keycastr"
cask "nightfall"
cask "notunes"
cask "obsidian"
cask "qlmarkdown"
cask "raycast"
cask "stats"
cask "vlc"
cargo "cargo-depgraph"
cargo "cargo-llvm-cov"
cargo "cargo-nextest"
cargo "ck-search"
cargo "viu"
